# Assignment 1: Data Parsing, Cleansing and Integration
## Task 3
#### Student Name: Pallavi Kollipara
#### Student ID: s4015344

Date: 25-04-24

Version: 1.0

Environment: Python 3 and Jupyter notebook

Libraries used: please include the main libraries you used in your assignment, e.g.,:
* pandas
* re
* datetime
* numpy


## Introduction

In this integration task, I first identified schema conflicts between the dataset from Task 2 (s4015344_dataset1_solution.csv) and the dataset from the current task (s4015344_dataset2.csv). To resolve these conflicts, I renamed all the required columns in s4015344_dataset2.csv to match the column names in s4015344_dataset1_solution.csv.

After renaming the columns, I ensured that both datasets contained the same data types for corresponding columns.

Next, I merged the two datasets (df1 and df2). Following the merge, I checked for duplicate records to ensure that the integrated dataset contained only unique records.

Finally, I converted the integrated DataFrame into a CSV file named s4015344_dataset_integrated.csv for further analysis and use. This process ensures that the integrated dataset maintains data consistency and accuracy while combining information from multiple sources.

##  Import libraries

In [1]:
# importing libraries
import numpy as np
import pandas as pd
import datetime

### 1. Examining and loading data
Examine "\s4015344_dataset2.csv" the structure and schema.

In [2]:

# read in two data set
df1 = pd.read_csv('s4015344_dataset1_solution.csv')
df2 = pd.read_csv('s4015344_dataset2.csv')
# Display two dataframes together to compare
print('S1:' + str(df1.shape))
display(df1.head())
print('S2:' + str(df2.shape))
display(df2.head())

S1:(50697, 11)

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,69747285,science teacher sundays,west london,trust education,part_time,non-specified,Teaching Jobs,25400.0,2012-09-17 15:00:00,2012-10-17 15:00:00,cv-library.co.uk
1,69022397,it support/rollout engineer,sheffield,matchtech group plc,non-specified,contract,IT Jobs,14400.0,2013-09-27 00:00:00,2013-10-27 00:00:00,cv-library.co.uk
2,69932721,electronics reliability analysis engineer,uk,innovate recruitment ltd,non-specified,permanent,Engineering Jobs,29000.0,2012-11-15 12:00:00,2013-02-13 12:00:00,cv-library.co.uk
3,67019364,project / planning coordinator,ely,i4 recruitment,non-specified,permanent,Engineering Jobs,21500.0,2012-04-26 15:00:00,2012-06-25 15:00:00,cv-library.co.uk
4,67903542,solutions architect ccnp ccip ccie,reading,jam recruitment ltd,non-specified,permanent,IT Jobs,55000.0,2013-12-19 15:00:00,2014-02-17 15:00:00,cv-library.co.uk

S2:(5000, 9)

,Job Title,Organisation,Monthly Payment,Contract Type,Category,Closing,Location,Full-Time Equivalent (FTE),Opening
0,Nursing Home Manager Thames Ditton,Liquid Personnel Ltd,2750.00,NaN,Healthcare and Nursing,2013-02-22 15:00:00,Thames Ditton,FULL TIME,2012-12-24 15:00:00
1,Deputy Manager Nursing Home RGN Shrewsbury,Liquid Personnel Ltd,2583.33,NaN,Healthcare and Nursing,2012-11-14 15:00:00,Shrewsbury,FULL TIME,2012-10-15 15:00:00
2,Deputy Manager Nursing Home (RGN) London,Liquid Personnel Ltd,3000.00,NaN,Healthcare and Nursing,2012-12-08 00:00:00,London,FULL TIME,2012-11-08 00:00:00
3,Deputy Manager (RGN) Nursing Home Bristol,Liquid Personnel Ltd,2791.67,NaN,Healthcare and Nursing,2013-01-13 15:00:00,Bristol,FULL TIME,2012-11-14 15:00:00
4,RGN or RMN Wigan,Eden Brown,2240.00,NaN,Healthcare and Nursing,2013-01-24 15:00:00,Wigan,FULL TIME,2012-11-25 15:00:00

In [3]:
print (df1.info())
print (df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50697 entries, 0 to 50696
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50697 non-null  int64
 1   Title         50697 non-null  object
 2   Location      50697 non-null  object
 3   Company       50528 non-null  object
 4   ContractType  50697 non-null  object
 5   ContractTime  50697 non-null  object
 6   Category      50697 non-null  object
 7   Salary        50697 non-null  float64
 8   OpenDate      50697 non-null  object
 9   CloseDate     50697 non-null  object
 10  SourceName    50697 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Job Title                   5000 non-null   object
 1   Organisation                4937 non-null   object
 2   Monthly Payment             5000 non-null   float64
 3   Contract Type               4312 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   object
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   object
dtypes: float64(1), object(8)
memory usage: 351.7+ KB
None

### 2. Resolving schema conflicts


#### Conflict 1: Monthly Payment 

We're handling monthly payments in one dataset df1, while the other dataset df2 has a similar column called "Salary," which is based on a yearly basis. To align these columns, I've converted the monthly payments to yearly payments by multiplying them by 12. Then, I renamed the column to "Salary" for consistency.

In [4]:
# Code to inspect data and identify conflicts in schema
# Assuming 'Monthly Payment' column contains the monthly payment values
df2['Monthly Payment'] = df2['Monthly Payment'] * 12
df2.head()

,Job Title,Organisation,Monthly Payment,Contract Type,Category,Closing,Location,Full-Time Equivalent (FTE),Opening
0,Nursing Home Manager Thames Ditton,Liquid Personnel Ltd,33000.00,NaN,Healthcare and Nursing,2013-02-22 15:00:00,Thames Ditton,FULL TIME,2012-12-24 15:00:00
1,Deputy Manager Nursing Home RGN Shrewsbury,Liquid Personnel Ltd,30999.96,NaN,Healthcare and Nursing,2012-11-14 15:00:00,Shrewsbury,FULL TIME,2012-10-15 15:00:00
2,Deputy Manager Nursing Home (RGN) London,Liquid Personnel Ltd,36000.00,NaN,Healthcare and Nursing,2012-12-08 00:00:00,London,FULL TIME,2012-11-08 00:00:00
3,Deputy Manager (RGN) Nursing Home Bristol,Liquid Personnel Ltd,33500.04,NaN,Healthcare and Nursing,2013-01-13 15:00:00,Bristol,FULL TIME,2012-11-14 15:00:00
4,RGN or RMN Wigan,Eden Brown,26880.00,NaN,Healthcare and Nursing,2013-01-24 15:00:00,Wigan,FULL TIME,2012-11-25 15:00:00

In [5]:
df2.rename(columns = {'Monthly Payment':'Salary'}, inplace = True)

#### Renamed the columns

I've updated the column names in DataFrame 2 to match those in DataFrame 1. Specifically, I renamed the columns "Opening," "Closing," "Job Title," "Organisation," "Contract Type," and "Full-Time Equivalent (FTE)" to align with the corresponding columns in DataFrame 1.

In [6]:
df2.rename(columns = {'Opening':'OpenDate'}, inplace = True)
df2.rename(columns = {'Closing':'CloseDate'}, inplace = True)
df2.rename(columns = {'Job Title':'Title'}, inplace = True)
df2.rename(columns = {'Organisation':'Company'}, inplace = True)
df2.rename(columns = {'Contract Type':'ContractTime'}, inplace = True)
df2.rename(columns = {'Full-Time Equivalent (FTE)':'ContractType'}, inplace = True)


#### Conflict 2: ContractTime


I've modified the values in the "Contract Type" column of DataFrame 2 to change "Fixed Term Contract" to "contract" and "Permanent" to "permanent" with a lowercase "p." This adjustment ensures consistency with DataFrame 1. And fixed null values by giving as non-specified.

In [7]:
df2['ContractTime'].unique()

array([nan, 'Permanent', 'Fixed Term Contract'], dtype=object)

In [8]:
df2['ContractTime'] = df2['ContractTime'].replace('Fixed Term Contract', 'contract')
df2['ContractTime'] = df2['ContractTime'].replace('Permanent', 'permanent')

In [9]:
df2['ContractTime'] = df2['ContractTime'].apply(lambda x: 'non-specified' if pd.isnull(x) else x)


#### Conflict 3: ContractType

In DataFrame 2, I've replaced "FULL TIME" with "full_time" and any records containing the pattern "FTE" with "part_time" to maintain consistency with DataFrame 1. And fixed null values by giving as non-specified.

In [10]:
df2['ContractType'].unique()

array(['FULL TIME', '0.6 FTE', '0.2 FTE', nan, '0.8 FTE', '0.4 FTE'],
      dtype=object)

In [11]:
df2['ContractType'] = df2['ContractType'].apply(lambda x: 'non-specified' if pd.isnull(x) else x)

In [12]:
pattern = r'0\.[2468] FTE'
# Replace 'FTE' with 'part_time' in those rows
df2['ContractType'] = df2['ContractType'].replace(pattern, 'part_time', regex=True)

In [13]:
df2['ContractType'] = df2['ContractType'].replace('FULL TIME', 'full_time')

In [14]:
df2.head()

,Title,Company,Salary,ContractTime,Category,CloseDate,Location,ContractType,OpenDate
0,Nursing Home Manager Thames Ditton,Liquid Personnel Ltd,33000.00,non-specified,Healthcare and Nursing,2013-02-22 15:00:00,Thames Ditton,full_time,2012-12-24 15:00:00
1,Deputy Manager Nursing Home RGN Shrewsbury,Liquid Personnel Ltd,30999.96,non-specified,Healthcare and Nursing,2012-11-14 15:00:00,Shrewsbury,full_time,2012-10-15 15:00:00
2,Deputy Manager Nursing Home (RGN) London,Liquid Personnel Ltd,36000.00,non-specified,Healthcare and Nursing,2012-12-08 00:00:00,London,full_time,2012-11-08 00:00:00
3,Deputy Manager (RGN) Nursing Home Bristol,Liquid Personnel Ltd,33500.04,non-specified,Healthcare and Nursing,2013-01-13 15:00:00,Bristol,full_time,2012-11-14 15:00:00
4,RGN or RMN Wigan,Eden Brown,26880.00,non-specified,Healthcare and Nursing,2013-01-24 15:00:00,Wigan,full_time,2012-11-25 15:00:00


#### Conflict 4: Id

I've created an "ID" column in DataFrame 2 since it was missing, and this ID column acts as a primary key for the dataset, ensuring consistency with DataFrame 1 before or after merging.

In [15]:

# Assuming df is your DataFrame
#df2['Id'] = np.random.randint(10000, 99999, size=len(df2))
num_rows = len(df2)
df2['Id'] = range(10000, 10000 + num_rows)

In [16]:
df1.info()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50697 entries, 0 to 50696
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50697 non-null  int64
 1   Title         50697 non-null  object
 2   Location      50697 non-null  object
 3   Company       50528 non-null  object
 4   ContractType  50697 non-null  object
 5   ContractTime  50697 non-null  object
 6   Category      50697 non-null  object
 7   Salary        50697 non-null  float64
 8   OpenDate      50697 non-null  object
 9   CloseDate     50697 non-null  object
 10  SourceName    50697 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         5000 non-null   object
 1   Company       4937 non-null   object
 2   Salary        5000 non-null   float64
 3   ContractTime  5000 non-null   object
 4   Category      5000 non-null   object
 5   CloseDate     5000 non-null   object
 6   Location      5000 non-null   object
 7   ContractType  5000 non-null   object
 8   OpenDate      5000 non-null   object
 9   Id            5000 non-null   int64
dtypes: float64(1), int64(1), object(8)
memory usage: 390.8+ KB


#### Conflict 4: Company

In DataFrame 2, I've replaced the null values in the company with non-specified.

In [17]:
df2['Company'] = df2['Company'].apply(lambda x: 'non-specified' if pd.isnull(x) else x)

Dropped the column SourceName in the df1 because of the schema conflict

In [18]:
df1.drop(columns=['SourceName'], inplace=True)

In [19]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50697 entries, 0 to 50696
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50697 non-null  int64
 1   Title         50697 non-null  object
 2   Location      50697 non-null  object
 3   Company       50528 non-null  object
 4   ContractType  50697 non-null  object
 5   ContractTime  50697 non-null  object
 6   Category      50697 non-null  object
 7   Salary        50697 non-null  float64
 8   OpenDate      50697 non-null  object
 9   CloseDate     50697 non-null  object
dtypes: float64(1), int64(1), object(8)
memory usage: 3.9+ MB

Just do double checking on the data types and make them consistent between df1 and df2 before merging.

In [20]:
# now adapt the datatypes in S1 to match S2
for y in [c for c in df1.columns if c in df2.columns]: # common columns
    if df1[y].dtype != df2[y].dtype:
        print ("Column " + y + "in df1: "+ str(df1[y].dtype) + "to" + str(df2[y].dtype))
        df1[y] = df1[y].astype(df2[y].dtype)

Seems all is consistent. 
Indeed, here, we have assumed a very simplistic case and we convert their formats one by one previously.

### 3. Merging data

After resolving all conflicts, I merged DataFrames 1 and 2.

In [21]:
# Code to merge two data sets
df = pd.concat([df1,df2])
print (df.shape)
df.sample(10)

(55697, 10)

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate
44757,71171242,sales manager online,uk,moriati media uk ltd,non-specified,non-specified,Sales Jobs,32500.00,2013-10-09 12:00:00,2013-10-23 12:00:00
31931,68293044,great opportunity for a sales executive high ...,london,corecruitment international,non-specified,non-specified,Hospitality & Catering Jobs,17000.00,2012-05-16 12:00:00,2012-06-15 12:00:00
27829,68067948,solar sales consultant aberdeen,aberdeen,simplified recruitment,non-specified,permanent,Sales Jobs,50000.00,2012-05-26 00:00:00,2012-07-25 00:00:00
6572,67895295,internal sales exec,reading,calibre candidates,non-specified,permanent,Sales Jobs,23000.00,2013-06-02 12:00:00,2013-08-01 12:00:00
42306,68663472,technician lancashire,lancashire,inspired selections,non-specified,non-specified,Healthcare & Nursing Jobs,16000.00,2012-02-04 12:00:00,2012-03-05 12:00:00
42528,68847314,1st line 2nd line support technician / helpde...,the city,searchability ltd,non-specified,permanent,IT Jobs,22500.00,2013-10-06 12:00:00,2013-11-05 12:00:00
41509,68591992,instrumentation & electrical technicians,lincolnshire,ata recruitment,non-specified,non-specified,Engineering Jobs,30750.00,2013-01-12 12:00:00,2013-01-26 12:00:00
1555,11555,Power Generation CCGT Project Manager,West Yorkshire,Jarvis King Associates Ltd,non-specified,permanent,Engineering,54999.96,2012-10-18 12:00:00,2012-12-17 12:00:00
35160,69144881,mathematics nqt,west midlands,edustaff birmingham,full_time,permanent,Teaching Jobs,23378.00,2012-05-16 12:00:00,2012-08-14 12:00:00
18628,68537757,health care assistant & support worker liverpool,liverpool,prestige nursing,full_time,non-specified,Healthcare & Nursing Jobs,29376.00,2012-05-29 00:00:00,2012-07-28 00:00:00

### 4. Resolving data conflicts:

Let's first try to check duplicates using all the records we have:

#### Conflict 1:  duplicate check
Let's drop the duplicates and keep the last record.

In [22]:
# Code to inspect data and identify conflicts in data
### check duplication
duplicates = df[df.duplicated(keep=False)] # showing all duplicated records
print ("There are "+ str(len(duplicates)) + " duplicate records found")
duplicates.sort_values(by=duplicates.columns.tolist()).head(10)

There are 0 duplicate records found

Empty DataFrame
Columns: [Id, Title, Location, Company, ContractType, ContractTime, Category, Salary, OpenDate, CloseDate]
Index: []

In [23]:
# Code to fix the conflict
# check duplication
cols = ['Id'] # this should uniquely identified a record, as the same bike could not be used by multiple trip started at the same time 
duplicates = df[df.duplicated(cols,keep=False)]
print ("There are "+ str(len(duplicates)) + " duplicate records found")
duplicates.sort_values(by=cols).head(10)

There are 0 duplicate records found

Empty DataFrame
Columns: [Id, Title, Location, Company, ContractType, ContractTime, Category, Salary, OpenDate, CloseDate]
Index: []

### 5. Saving the integrated and reshaped data
The last part of the integration process is to export our output data to csv format, named as:
- '\s4015344_dataset_integrated.csv'

In [24]:
# code to save output data
df.to_csv("s4015344_dataset_integrated.csv",index = False)

## Summary of the Assessment Task


In task 3, we tackled data integration.

Ideally, after resolving all schema conflicts, identifying duplicates using complete records would be straightforward. However, in practice, this is often not the case.